app/Http/Controllers/PagesController.php

    public function home()
    {
        $users_map_infos = User::select(array('id', 'address_latitude', 'address_longitude', 'username', 'avatar', 'description'))->get();
---
select `id`, `address_latitude`, `address_longitude`, `username`, `avatar`, `description` from `users`

    public function users_list()
    {
        $users_list = User::orderBy('created_at', 'DESC')->paginate(10);
---
select * from `users` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `users`

    public function admin()
    {
        $current_user = Auth::user();
        $users = User::all();
        $pages = StaticPages::all();
---
select * from `users`
select * from `static_pages`