app/Http/Controllers/ProfileController.php

    public function update(Request $request, User $user)
    {
        $this->authorize('manage', $user);
        $request->validate([
            'email' => ['required', 'string', 'email', 'max:255', 'unique:users,email,' . $user->id],
            'username' => ['required', 'string', 'max:255', 'min:3', 'unique:users,username,' . $user->id],
            'first_name' => ['nullable', 'string', 'min:3','max:255'],
            'last_name' => ['nullable', 'string', 'min:3','max:255'],
            'address_city' => ['nullable', 'string', 'max:255'],
            'address_latitude' => ['nullable', 'numeric'],
            'address_longitude' => ['nullable', 'numeric'],
            'description' => ['nullable', 'string', 'min:3','max:255'],
            'avatar' => ['nullable', 'image', 'mimes:jpeg,gif,jpg,png', 'max:2048'],
        ]);
        $this->updateAvatar($request, $user);
---
update `users` set `address_latitude` = '', `address_longitude` = '', `avatar` = '1565861573.jpg', `users`.`updated_at` = '2019-08-15 09:32:53' where `id` = 1